---
type: ViewOrientation3D
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ViewOrientation3D

`Autodesk.Revit.DB.ViewOrientation3D` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ViewOrientation3D | 2013 | `public ViewOrientation3D ( XYZ eyePosition , XYZ upDirection , XYZ forwardDirection )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | EyePosition | 2013 | `public XYZ EyePosition { get ; }` |
| Property | ForwardDirection | 2013 | `public XYZ ForwardDirection { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | UpDirection | 2013 | `public XYZ UpDirection { get ; }` |